In [1]:
# import dependencies
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('dataset/train.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# define columns we're interested in
y_cols = ['Survived']
x_cols = ['Pclass','Age','Fare','Sex']

In [21]:
# define X and y training sets
X = data[x_cols]
y = data[y_cols]

In [22]:
# look for na values in the training data
X.isna().sum()

Pclass      0
Age       177
Fare        0
Sex         0
dtype: int64

In [23]:
# summarize training data
X_train.describe()

           Pclass         Age        Fare         Sex
count  891.000000  891.000000  891.000000  891.000000
mean     2.308642   29.361582   32.204208    0.352413
std      0.836071   13.019697   49.693429    0.477990
min      1.000000    0.420000    0.000000    0.000000
25%      2.000000   22.000000    7.910400    0.000000
50%      3.000000   28.000000   14.454200    0.000000
75%      3.000000   35.000000   31.000000    1.000000
max      3.000000   80.000000  512.329200    1.000000

In [24]:
# fill age na values with the median age value
X['Age'].fillna(X['Age'].median(),inplace=True)

C:\Users\Selim\Anaconda3\envs\tfenv\lib\site-packages\pandas\core\generic.py:4355: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

In [25]:
X.head()

   Pclass   Age     Fare     Sex
0       3  22.0   7.2500    male
1       1  38.0  71.2833  female
2       3  26.0   7.9250  female
3       1  35.0  53.1000  female
4       3  35.0   8.0500    male

In [26]:
# convert sex category from string to int value
d = {'male':0,'female':1}
X['Sex'] = X['Sex'].apply(lambda x: d[x])

C:\Users\Selim\Anaconda3\envs\tfenv\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [27]:
X.head()

   Pclass   Age     Fare  Sex
0       3  22.0   7.2500    0
1       1  38.0  71.2833    1
2       3  26.0   7.9250    1
3       1  35.0  53.1000    1
4       3  35.0   8.0500    0

In [29]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.30,random_state=42)

In [30]:
X_train.head()

     Pclass   Age     Fare  Sex
445       1   4.0  81.8583    0
650       3  28.0   7.8958    0
172       3   1.0  11.1333    1
450       2  36.0  27.7500    0
314       2  43.0  26.2500    0

In [63]:
from sklearn import svm

# define model
clf = svm.LinearSVC(C=0.8,max_iter=1000)

# use a support vector machine to train the model to our dataset
clf.fit(X_train,y_train)

C:\Users\Selim\Anaconda3\envs\tfenv\lib\site-packages\sklearn\utils\validation.py:578: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LinearSVC(C=0.7, class_weight=None, dual=True, fit_intercept=True,
     intercept_scaling=1, loss='squared_hinge', max_iter=1000,
     multi_class='ovr', penalty='l2', random_state=None, tol=0.0001,
     verbose=0)

In [34]:
X_test.head()

     Pclass   Age     Fare  Sex
709       3  28.0  15.2458    0
439       2  31.0  10.5000    0
840       3  20.0   7.9250    0
720       2   6.0  33.0000    1
39        3  14.0  11.2417    1

In [38]:
# now that our classifier model has been trained, we can make predictions on our test dataset
clf.predict(X_test[0:10])

array([0, 0, 0, 1, 1, 1, 1, 0, 1, 1], dtype=int64)

In [64]:
# now we can check the accuracy of our model
clf.score(X_test,y_test)

0.76865671641791045